package lection2;

import java.util.List;

/**
 * Возьмите список, верните одно значение
 * Распространенный сценарий:
 *
 * 1.вам дан список значений
 * 2.вы берете все эти значения и вычисляете из них одно значение
 * 3.вернуть это вычисленное значение
 *
 * Задачи
 *
 * 1. У вас есть список значений String, и вы должны вернуть одну строку,
 * которая представляет собой конкатенацию всех значений.
 * 2. У вас есть список значений int и вы должны вернуть их сумму
 * 3. У вас есть список значений int и вы должны вернуть их максимум или минимум
 * 4. У вас есть список String и вы должны вернуть максимальную длину
 */
public class Task3 {

    public static List<String> task1 (){

    }
}
