package lection1.multidimensionalArrays;

/**
 * Проверьте, является ли двумерный массив симметричным относительно главной диагонали. Главная диагональ — та, которая идёт из левого верхнего угла двумерного массива в правый нижний.
 *
 * Пример симметричного массива.
 *
 * int[][] array = {
 *                 {2, 3, 5, 10, 11},
 *                 {3, 2, 4,  6, 9},
 *                 {5, 4, 2,  7, 12},
 *                 {10, 6, 7, 2,  8},
 *                 {11, 9, 12, 8, 2}};
 *
 * Пример несимметричного массива.
 *
 * int[][] array = {
 *                 {2, 3, 5, 10, 222},
 *                 {3, 2, 4,  6, 9},
 *                 {5, 4, 2,  7, 12},
 *                 {10, 6, 7, 2,  8},
 *                 {11, 9, 12, 8, 2}};
 */
public class Task4 {

// TODO написать код

}
